Обработки/Reports/_РасчетДоходностиПоМетодикеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиПоМетодикеПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВводыВыводы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиПоМетодикеПФР/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.ВариантОтчета	= Элементы.ВариантОтчета.СписокВыбора[0].Значение;
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период		= Новый СтандартныйПериод(НачалоГода(ТекущаяДата()), КонецДня(ТекущаяДата()));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьИДоступность(ЭтаФорма);
	УстановитьИспользуемоеИмяФайла();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы
	
&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	УстановитьИспользуемоеИмяФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьИспользуемоеИмяФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	УстановитьИспользуемоеИмяФайла();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Отчет;
	Элементы      = Форма.Элементы;
	
	Элементы.Период.Видимость				= (ДанныеОбъекта.ВариантОтчета = "ОтчетОбИзмененииДоходности");
	Элементы.ТолькоВводыВыводы.Видимость	= (ДанныеОбъекта.ВариантОтчета = "ОтчетОбИзмененииДоходности");
	
	Элементы.ПериодДатаОкончания.Видимость	= (ДанныеОбъекта.ВариантОтчета = "СведенияОДоходностиИнвестированияСредствПенсионныхНакоплений");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользуемоеИмяФайла()
	
	Элементы.Результат.ИспользуемоеИмяФайла = РаботаСоСтрокамиКлиентСервер.ПреобразоватьСтрокуСЗаглавнымиБуквами(Отчет.ВариантОтчета) + " " + Отчет.СчетДоверительногоУправления + " на " + Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"); 

КонецПроцедуры


#КонецОбласти
